In [1]:
import pandas as pd

In [2]:
#eb= Entertainer basic table 
#ebt = entertainer breakthrough
#el = entertainer lastwork

In [9]:
eb = pd.read_excel('Entertainer - Basic Info.xlsx')

In [11]:
eb.head()

       Entertainer Gender (traditional)  Birth Year
0            Adele                    F        1988
1   Angelina Jolie                    F        1975
2  Aretha Franklin                    F        1942
3      Bette Davis                    F        1908
4      Betty White                    F        1922

In [26]:
ebt = pd.read_excel('Entertainer - Breakthrough Info.xlsx')

In [28]:
ebt.drop('Entertainer',inplace=True,axis=1)

In [29]:
ebt.head()

,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy
0,2008,19,2009.0
1,1999,"Girl, Interrupted",1999.0
2,1967,I Never Loved a Man (The Way I Love You),1968.0
3,1934,Of Human Bondage,1935.0
4,1952,Life with Elilzabeth,1976.0

In [30]:
el = pd.read_excel('Entertainer - Last work Info.xlsx')

In [31]:
el.drop('Entertainer',inplace=True,axis=1)

In [32]:
el.head()

   Year of Last Major Work (arguable)  Year of Death
0                                2016            NaN
1                                2016            NaN
2                                2014            NaN
3                                1989         1989.0
4                                2016            NaN

In [33]:
# concating the first two tables (eb and ebt)

In [34]:
main1 = pd.concat([eb,ebt],axis=1)

In [35]:
main1.head()

,Entertainer,Gender (traditional),Birth Year,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy
0,Adele,F,1988,2008,19,2009.0
1,Angelina Jolie,F,1975,1999,"Girl, Interrupted",1999.0
2,Aretha Franklin,F,1942,1967,I Never Loved a Man (The Way I Love You),1968.0
3,Bette Davis,F,1908,1934,Of Human Bondage,1935.0
4,Betty White,F,1922,1952,Life with Elilzabeth,1976.0

In [36]:
main=pd.concat([main1,el],axis=1)

In [43]:
main.head()

,Entertainer,Gender (traditional),Birth Year,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy,Year of Last Major Work (arguable),Year of Death
0,Adele,F,1988,2008,19,2009.0,2016,NaN
1,Angelina Jolie,F,1975,1999,"Girl, Interrupted",1999.0,2016,NaN
2,Aretha Franklin,F,1942,1967,I Never Loved a Man (The Way I Love You),1968.0,2014,NaN
3,Bette Davis,F,1908,1934,Of Human Bondage,1935.0,1989,1989.0
4,Betty White,F,1922,1952,Life with Elilzabeth,1976.0,2016,NaN

In [45]:
#saving this file into excel file

In [46]:
new_file ='main_data.xlsx'

In [47]:
main.to_excel(new_file)